balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F46K22.PIC
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="ANSELC" edc:desc="PORTC analog select bits" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="111111--" edc:name="ANSELC" edc:nzwidth="0x8" edc:por="111111--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ANSC2" edc:desc="RC2 analog select" edc:mask="0x1" edc:name="ANSC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC3" edc:desc="RC3 analog select" edc:mask="0x1" edc:name="ANSC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC4" edc:desc="RC4 analog select" edc:mask="0x1" edc:name="ANSC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC5" edc:desc="RC5 analog select" edc:mask="0x1" edc:name="ANSC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC6" edc:desc="RC6 analog select" edc:mask="0x1" edc:name="ANSC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC7" edc:desc="RC7 analog select" edc:mask="0x1" edc:name="ANSC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELD" edc:desc="PORTD analog select bits" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELD" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSD0" edc:desc="RD0 analog select" edc:mask="0x1" edc:name="ANSD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSD1" edc:desc="RD1 analog select" edc:mask="0x1" edc:name="ANSD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSD2" edc:desc="RD2 analog select" edc:mask="0x1" edc:name="ANSD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSD3" edc:desc="RD3 analog select" edc:mask="0x1" edc:name="ANSD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSD4" edc:desc="RD4 analog select" edc:mask="0x1" edc:name="ANSD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSD5" edc:desc="RD5 analog select" edc:mask="0x1" edc:name="ANSD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSD6" edc:desc="RD6 analog select" edc:mask="0x1" edc:name="ANSD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSD7" edc:desc="RD7 analog select" edc:mask="0x1" edc:name="ANSD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ANSELE" edc:desc="PORTE analog select bits" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ANSELE" edc:nzwidth="0x8" edc:por="-----111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSE0" edc:desc="RE0 analog select" edc:mask="0x1" edc:name="ANSE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSE1" edc:desc="RE1 analog select" edc:mask="0x1" edc:name="ANSE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSE2" edc:desc="RE2 analog select" edc:mask="0x1" edc:name="ANSE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PMD2" edc:desc="Power mode control bits" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PMD2" edc:nzwidth="0x8" edc:por="----0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="ADC power mode control" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="Comparator 1 power mode control" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="Comparator 2 power mode control" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTMUMD" edc:desc="CTMU power mode control" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="PMD1" edc:desc="Power mode control bits" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="PMD1" edc:nzwidth="0x8" edc:por="00-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="CCP1 power mode control" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2MD" edc:desc="CCP2 power mode control" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3MD" edc:desc="CCP3 power mode control" edc:mask="0x1" edc:name="CCP3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP4MD" edc:desc="CCP4 power mode control" edc:mask="0x1" edc:name="CCP4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5MD" edc:desc="CCP5 power mode control" edc:mask="0x1" edc:name="CCP5MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MSSP1MD" edc:desc="MSSP1 power mode control" edc:mask="0x1" edc:name="MSSP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSSP2MD" edc:desc="MSSP2 power mode control" edc:mask="0x1" edc:name="MSSP2MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
